jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: BIAS_EN
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_BIAS_EN_MASK        (uint16_t)0x0001U
#define   WM8994_PWR_MGMT_1_BIAS_EN_POSITION    0
int32_t  wm8994_pwr_mgmt_1_bias_en(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: VMID_SEL [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_VMID_SEL_MASK        (uint16_t)0x0006U
#define   WM8994_PWR_MGMT_1_VMID_SEL_POSITION    1
int32_t  wm8994_pwr_mgmt_1_vmid_sel(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: MICB1_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_MICB1_ENA_MASK        (uint16_t)0x0010U
#define   WM8994_PWR_MGMT_1_MICB1_ENA_POSITION    4
int32_t  wm8994_pwr_mgmt_1_micb1_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: MICB2_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_MICB2_ENA_MASK        (uint16_t)0x0020U
#define   WM8994_PWR_MGMT_1_MICB2_ENA_POSITION    5
int32_t  wm8994_pwr_mgmt_1_micb2_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: HPOUT1R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_HPOUT1R_ENA_MASK        (uint16_t)0x0100U
#define   WM8994_PWR_MGMT_1_HPOUT1R_ENA_POSITION    8
int32_t  wm8994_pwr_mgmt_1_hpout1r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: HPOUT1L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_HPOUT1L_ENA_MASK        (uint16_t)0x0200U
#define   WM8994_PWR_MGMT_1_HPOUT1L_ENA_POSITION    9
int32_t  wm8994_pwr_mgmt_1_hpout1l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: HPOUT2_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_HPOUT2_ENA_MASK        (uint16_t)0x0800U
#define   WM8994_PWR_MGMT_1_HPOUT2_ENA_POSITION    11
int32_t  wm8994_pwr_mgmt_1_hpout2_ena(wm8994_ctx_t *ctx, uint16_t value);
    
/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: SPKOUTL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_SPKOUTL_ENA_MASK        (uint16_t)0x1000U
#define   WM8994_PWR_MGMT_1_SPKOUTL_ENA_POSITION    12
int32_t  wm8994_pwr_mgmt_1_spkoutl_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_1
* Address       : 0X01
* Bit Group Name: SPKOUTR_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_1_SPKOUTR_ENA_MASK        (uint16_t)0x2000U
#define   WM8994_PWR_MGMT_1_SPKOUTR_ENA_POSITION    13
int32_t  wm8994_pwr_mgmt_1_spkoutr_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: IN1R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_IN1R_ENA_MASK        (uint16_t)0x0010U
#define   WM8994_PWR_MGMT_2_IN1R_ENA_POSITION    4
int32_t  wm8994_pwr_mgmt_2_in1r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: IN2R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_IN2R_ENA_MASK        (uint16_t)0x0020U
#define   WM8994_PWR_MGMT_2_IN2R_ENA_POSITION    5
int32_t  wm8994_pwr_mgmt_2_in2r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: IN1L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_IN1L_ENA_MASK        (uint16_t)0x0040U
#define   WM8994_PWR_MGMT_2_IN1L_ENA_POSITION    6
int32_t  wm8994_pwr_mgmt_2_in1l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: IN2L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_IN2L_ENA_MASK        (uint16_t)0x0080U
#define   WM8994_PWR_MGMT_2_IN2L_ENA_POSITION    7
int32_t  wm8994_pwr_mgmt_2_in2l_ena(wm8994_ctx_t *ctx, uint16_t value);

