jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: MIXINR_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_MIXINR_ENA_MASK        (uint16_t)0x0100U
#define   WM8994_PWR_MGMT_2_MIXINR_ENA_POSITION    8
int32_t  wm8994_pwr_mgmt_2_mixinr_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: MIXINL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_MIXINL_ENA_MASK        (uint16_t)0x0200U
#define   WM8994_PWR_MGMT_2_MIXINL_ENA_POSITION    9
int32_t  wm8994_pwr_mgmt_2_mixinl_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: OPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_OPCLK_ENA_MASK        (uint16_t)0x0800U
#define   WM8994_PWR_MGMT_2_OPCLK_ENA_POSITION    11
int32_t  wm8994_pwr_mgmt_2_opclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: TSHUT_OPDIS
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_TSHUT_OPDIS_MASK        (uint16_t)0x2000U
#define   WM8994_PWR_MGMT_2_TSHUT_OPDIS_POSITION    13
int32_t  wm8994_pwr_mgmt_2_tshut_opdis(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_2
* Address       : 0X02
* Bit Group Name: TSHUT_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_2_TSHUT_ENA_MASK        (uint16_t)0x4000U
#define   WM8994_PWR_MGMT_2_TSHUT_ENA_POSITION    14
int32_t   wm8994_pwr_mgmt_2_tshut_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: MIXOUTR_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_MIXOUTR_ENA_MASK        (uint16_t)0x0010U
#define   WM8994_PWR_MGMT_3_MIXOUTR_ENA_POSITION    4
int32_t   wm8994_pwr_mgmt_3_mixoutr_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: MIXOUTL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_MIXOUTL_ENA_MASK        (uint16_t)0x0020U
#define   WM8994_PWR_MGMT_3_MIXOUTL_ENA_POSITION    5
int32_t   wm8994_pwr_mgmt_3_mixoutl_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: MIXOUTRVOL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_MIXOUTRVOL_ENA_MASK        (uint16_t)0x0040U
#define   WM8994_PWR_MGMT_3_MIXOUTRVOL_ENA_POSITION    6
int32_t   wm8994_pwr_mgmt_3_mixoutrvol_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: MIXOUTLVOL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_MIXOUTLVOL_ENA_MASK        (uint16_t)0x0080U
#define   WM8994_PWR_MGMT_3_MIXOUTLVOL_ENA_POSITION    7
int32_t   wm8994_pwr_mgmt_3_mixoutlvol_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: SPKLVOL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_SPKLVOL_ENA_MASK        (uint16_t)0x0100U
#define   WM8994_PWR_MGMT_3_SPKLVOL_ENA_POSITION    8
int32_t   wm8994_pwr_mgmt_3_spklvol_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: SPKRVOL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_SPKRVOL_ENA_MASK        (uint16_t)0x0200U
#define   WM8994_PWR_MGMT_3_SPKRVOL_ENA_POSITION    9
int32_t   wm8994_pwr_mgmt_3_spkrvol_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: LINEOUT2P_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_LINEOUT2P_ENA_MASK        (uint16_t)0x0400U
#define   WM8994_PWR_MGMT_3_LINEOUT2P_ENA_POSITION    10
int32_t   wm8994_pwr_mgmt_3_lineout2p_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: LINEOUT2N_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_LINEOUT2N_ENA_MASK        (uint16_t)0x0800U
#define   WM8994_PWR_MGMT_3_LINEOUT2N_ENA_POSITION    11
int32_t   wm8994_pwr_mgmt_3_lineout2n_ena(wm8994_ctx_t *ctx, uint16_t value);

