jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_2
* Address       : 0X2E
* Bit Group Name: IN2LN_TO_MIXOUTR
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER2_IN2LN_TO_MIXOUTR_MASK          (uint16_t)0x0020
#define   WM8994_OUTMIXER2_IN2LN_TO_MIXOUTR_POSITION      5
int32_t   wm8994_outmixer2_in2ln_to_mixoutr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_2
* Address       : 0X2E
* Bit Group Name: MIXINR_TO_MIXOUTR
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER2_MIXINR_TO_MIXOUTR_MASK          (uint16_t)0x0040
#define   WM8994_OUTMIXER2_MIXINR_TO_MIXOUTR_POSITION      6
int32_t   wm8994_outmixer2_mixinr_to_mixoutr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_2
* Address       : 0X2E
* Bit Group Name: MIXINL_TO_MIXOUTR
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER2_MIXINL_TO_MIXOUTR_MASK          (uint16_t)0x0080
#define   WM8994_OUTMIXER2_MIXINL_TO_MIXOUTR_POSITION      7
int32_t   wm8994_outmixer2_mixinl_to_mixoutr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_2
* Address       : 0X2E
* Bit Group Name: DAC1R_TO_HPOUT1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER2_DAC1R_TO_HPOUT1R_MASK          (uint16_t)0x0100
#define   WM8994_OUTMIXER2_DAC1R_TO_HPOUT1R_POSITION      8
int32_t   wm8994_outmixer2_dac1r_to_hpout1r(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x2F to (uint16_t)0x35 are not implemented here */

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: DAC1R_TO_SPKMIXR
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_DAC1R_TO_SPKMIXR_MASK          (uint16_t)0x0001
#define   WM8994_SPKMIXER_DAC1R_TO_SPKMIXR_POSITION      0
int32_t   wm8994_spkmixer_dac1r_to_spkmixr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: DAC1L_TO_SPKMIXL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_DAC1L_TO_SPKMIXL_MASK          (uint16_t)0x0002
#define   WM8994_SPKMIXER_DAC1L_TO_SPKMIXL_POSITION      1
int32_t   wm8994_spkmixer_dac1l_to_spkmixl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: MIXOUTR_TO_SPKMIXR
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_MIXOUTR_TO_SPKMIXR_MASK          (uint16_t)0x0004
#define   WM8994_SPKMIXER_MIXOUTR_TO_SPKMIXR_POSITION      2
int32_t   wm8994_spkmixer_mixoutr_to_spkmixr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: MIXOUTL_TO_SPKMIXL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_MIXOUTL_TO_SPKMIXL_MASK          (uint16_t)0x0008
#define   WM8994_SPKMIXER_MIXOUTL_TO_SPKMIXL_POSITION      3
int32_t   wm8994_spkmixer_mixoutl_to_spkmixl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: IN1RP_TO_SPKMIXR
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_IN1RP_TO_SPKMIXR_MASK          (uint16_t)0x0010
#define   WM8994_SPKMIXER_IN1RP_TO_SPKMIXR_POSITION      4
int32_t   wm8994_spkmixer_in1rp_to_spkmixr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: IN1LP_TO_SPKMIXL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_IN1LP_TO_SPKMIXL_MASK          (uint16_t)0x0020
#define   WM8994_SPKMIXER_IN1LP_TO_SPKMIXL_POSITION      5
int32_t   wm8994_spkmixer_in1lp_to_spkmixl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: MIXINR_TO_SPKMIXR
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_MIXINR_TO_SPKMIXR_MASK          (uint16_t)0x0040
#define   WM8994_SPKMIXER_MIXINR_TO_SPKMIXR_POSITION      6
int32_t   wm8994_spkmixer_mixinr_to_spkmixr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPEAKER_MIXER
* Address       : 0X36
* Bit Group Name: MIXINL_TO_SPKMIXL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXER_MIXINL_TO_SPKMIXL_MASK          (uint16_t)0x0080
#define   WM8994_SPKMIXER_MIXINL_TO_SPKMIXL_POSITION      7
int32_t   wm8994_spkmixer_mixinl_to_spkmixl(wm8994_ctx_t *ctx, uint16_t value);

