jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/* Note: Registers (uint16_t)0x201, (uint16_t)0x204 and (uint16_t)0x205 are not implemented here */

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: SYSCLK_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_SYSCLK_SRC_MASK                 (uint16_t)0x0001
#define   WM8994_CLOCKING1_SYSCLK_SRC_POSITION             0
int32_t   wm8994_clocking1_sysclk_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: SYSDSPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_SYSDSPCLK_ENA_MASK                 (uint16_t)0x0002
#define   WM8994_CLOCKING1_SYSDSPCLK_ENA_POSITION             1
int32_t   wm8994_clocking1_sysdspclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: AIF2DSPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_AIF2DSPCLK_ENA_MASK                 (uint16_t)0x0004
#define   WM8994_CLOCKING1_AIF2DSPCLK_ENA_POSITION             2
int32_t   wm8994_clocking1_aif2dspclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: AIF1DSPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_AIF1DSPCLK_ENA_MASK                 (uint16_t)0x0008
#define   WM8994_CLOCKING1_AIF1DSPCLK_ENA_POSITION             3
int32_t   wm8994_clocking1_aif1dspclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: TOCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_TOCLK_ENA_MASK                 (uint16_t)0x0010
#define   WM8994_CLOCKING1_TOCLK_ENA_POSITION             4
int32_t   wm8994_clocking1_toclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING2
* Address       : 0X209
* Bit Group Name: OPCLK_DIV[2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING2_OPCLK_DIV_MASK                 (uint16_t)0x0007
#define   WM8994_CLOCKING2_OPCLK_DIV_POSITION             0
int32_t   wm8994_clocking2_opclk_div(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING2
* Address       : 0X209
* Bit Group Name: DBCLK_DIV[2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING2_DBCLK_DIV_MASK                 (uint16_t)0x0070
#define   WM8994_CLOCKING2_DBCLK_DIV_POSITION             4
int32_t   wm8994_clocking2_dbclk_div(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING2
* Address       : 0X209
* Bit Group Name: TOCLK_DIV[2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING2_TOCLK_DIV_MASK                 (uint16_t)0x0700
#define   WM8994_CLOCKING2_TOCLK_DIV_POSITION             8
int32_t   wm8994_clocking2_toclk_div(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_RATE
* Address       : 0X210
* Bit Group Name: AIF1CLK_RATE [3:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CLK_RATE_MASK                 (uint16_t)0x000F
#define   WM8994_AIF1_CLK_RATE_POSITION             0
int32_t   wm8994_aif1_clk_rate(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_RATE
* Address       : 0X210
* Bit Group Name: AIF1_SR [3:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_SR_MASK                 (uint16_t)0x00F0
#define   WM8994_AIF1_SR_POSITION             4
int32_t   wm8994_aif1_sr(wm8994_ctx_t *ctx, uint16_t value);
int32_t   wm8994_aif1_sr_r(wm8994_ctx_t *ctx, uint16_t *value);

/* Note: Registers (uint16_t)0x211, (uint16_t)0x212, (uint16_t)0x220, (uint16_t)0x221, (uint16_t)0x222, (uint16_t)0x223, (uint16_t)0x224,
         (uint16_t)0x240, (uint16_t)0x241, (uint16_t)0x242, (uint16_t)0x243 and (uint16_t)0x244  are not implemented here */

/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1_FMT [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_FMT_MASK                 (uint16_t)0x0018U
#define   WM8994_AIF1_CONTROL1_FMT_POSITION             3
int32_t   wm8994_aif1_control1_fmt(wm8994_ctx_t *ctx, uint16_t value);
int32_t   wm8994_aif1_control1_fmt_r(wm8994_ctx_t *ctx, uint16_t *value);

/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1_WL [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_WL_MASK                 (uint16_t)0x0060
#define   WM8994_AIF1_CONTROL1_WL_POSITION             5
int32_t   wm8994_aif1_control1_wl(wm8994_ctx_t *ctx, uint16_t value);
int32_t   wm8994_aif1_control1_wl_r(wm8994_ctx_t *ctx, uint16_t *value);
/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1_LRCLK_INV
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_LRCLK_INV_MASK                 (uint16_t)0x0080
#define   WM8994_AIF1_CONTROL1_LRCLK_INV_POSITION             7
int32_t   wm8994_aif1_control1_lrclk_inv(wm8994_ctx_t *ctx, uint16_t value);

