jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DAC1_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_DAC1_DRC_ENA_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1DRC1_DAC1_DRC_ENA_POSITION             2
int32_t   wm8994_aif1drc1_dac1_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_ANTICLIP
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_ANTICLIP_MASK                 (uint16_t)0x0008
#define   WM8994_AIF1DRC1_ANTICLIP_POSITION             3
int32_t   wm8994_aif1drc1_anticlip(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_QR
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_QR_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1DRC1_QR_POSITION             4
int32_t   wm8994_aif1drc1_qr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_KNEE2_OP_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_KNEE2_OP_ENA_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1DRC1_KNEE2_OP_ENA_POSITION             5
int32_t   wm8994_aif1drc1_knee2_op_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_SIG_DET
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_SIG_DET_MASK                 (uint16_t)0x0040
#define   WM8994_AIF1DRC1_SIG_DET_POSITION             6
int32_t   wm8994_aif1drc1_sig_det(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_SIG_DET_MODE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_SIG_DET_MODE_MASK                 (uint16_t)0x0080
#define   WM8994_AIF1DRC1_SIG_DET_MODE_POSITION             7
int32_t   wm8994_aif1drc1_sig_det_mode(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_NG_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_NG_ENA_MASK                 (uint16_t)0x0100
#define   WM8994_AIF1DRC1_NG_ENA_POSITION             8
int32_t   wm8994_aif1drc1_ng_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_SIG_DET_PK[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_SIG_DET_PK_MASK                 (uint16_t)0x0600
#define   WM8994_AIF1DRC1_SIG_DET_PK_POSITION             9
int32_t   wm8994_aif1drc1_sig_det_pk(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_SIG_DET_RMS[4:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_SIG_DET_RMS_MASK                 (uint16_t)0xF800
#define   WM8994_AIF1DRC1_SIG_DET_RMS_POSITION             11
int32_t   wm8994_aif1drc1_sig_det_rms(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x0421, (uint16_t)0x0423, and (uint16_t)0x0441 to (uint16_t)0x0444 are not implemented here */


/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1ADC2R_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_ADC2R_DRC_ENA_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1DRC2_ADC2R_DRC_ENA_POSITION             0
int32_t   wm8994_aif1drc2_adc2r_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1ADC2L_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_ADC2L_DRC_ENA_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1DRC2_ADC2L_DRC_ENA_POSITION             1
int32_t   wm8994_aif1drc2_adc2l_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DAC2_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_DAC2_DRC_ENA_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1DRC2_DAC2_DRC_ENA_POSITION             2
int32_t   wm8994_aif1drc2_dac2_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

