jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_ANTICLIP
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_ANTICLIP_MASK                 (uint16_t)0x0008
#define   WM8994_AIF1DRC2_ANTICLIP_POSITION             3
int32_t   wm8994_aif1drc2_anticlip(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_QR
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_QR_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1DRC2_QR_POSITION             4
int32_t   wm8994_aif1drc2_qr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_KNEE2_OP_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_KNEE2_OP_ENA_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1DRC2_KNEE2_OP_ENA_POSITION             5
int32_t   wm8994_aif1drc2_knee2_op_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_SIG_DET
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_SIG_DET_MASK                 (uint16_t)0x0040
#define   WM8994_AIF1DRC2_SIG_DET_POSITION             6
int32_t   wm8994_aif1drc2_sig_det(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_SIG_DET_MODE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_SIG_DET_MODE_MASK                 (uint16_t)0x0080
#define   WM8994_AIF1DRC2_SIG_DET_MODE_POSITION             7
int32_t   wm8994_aif1drc2_sig_det_mode(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_NG_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_NG_ENA_MASK                 (uint16_t)0x0100
#define   WM8994_AIF1DRC2_NG_ENA_POSITION             8
int32_t   wm8994_aif1drc2_ng_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_SIG_DET_PK[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_SIG_DET_PK_MASK                 (uint16_t)0x0600
#define   WM8994_AIF1DRC2_SIG_DET_PK_POSITION             9
int32_t   wm8994_aif1drc2_sig_det_pk(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC2
* Address       : 0X450
* Bit Group Name: AIF1DRC2_SIG_DET_RMS[4:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC2_SIG_DET_RMS_MASK                 (uint16_t)0xF800
#define   WM8994_AIF1DRC2_SIG_DET_RMS_POSITION             11
int32_t   wm8994_aif1drc2_sig_det_rms(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x0451 to (uint16_t)0x0454
         Registers (uint16_t)0x0480 to (uint16_t)0x0493
         Registers (uint16_t)0x04A0 to (uint16_t)0x04B3
         Registers 0X0500, 0X0501, 0X0502, 0X0503, 0X0510, 0X0520, 0X0521
         Registers (uint16_t)0x0540 to (uint16_t)0x0544
         Registers (uint16_t)0x0580 to (uint16_t)0x0593
         are not implemented here */

/*******************************************************************************
* Register      : WM8994_DAC1_MIXER_VOL
* Address       : 0X600
* Bit Group Name: ADCL_DAC1_VOL [3:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_MIXER_VOL_ADCL_MASK                 (uint16_t)0x000F
#define   WM8994_DAC1_MIXER_VOL_ADCL_POSITION             0
int32_t   wm8994_dac1_mixer_vol_adcl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_MIXER_VOL
* Address       : 0X600
* Bit Group Name: ADCR_DAC1_VOL [3:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_MIXER_VOL_ADCR_MASK                 (uint16_t)0x001E
#define   WM8994_DAC1_MIXER_VOL_ADCR_POSITION             5
int32_t   wm8994_dac1_mixer_vol_adcr(wm8994_ctx_t *ctx, uint16_t value);
         
/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_LMR
* Address       : 0X601
* Bit Group Name: AIF1DAC1L_TO_DAC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_LMRDAC1L_TO_DAC1L_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1_DAC1_LMRDAC1L_TO_DAC1L_POSITION             0
int32_t   wm8994_aif1_dac1_lmrdac1l_to_dac1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_LMR
* Address       : 0X601
* Bit Group Name: AIF1DAC2L_TO_DAC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_LMRDAC2L_TO_DAC1L_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1_DAC1_LMRDAC2L_TO_DAC1L_POSITION             1
int32_t   wm8994_aif1_dac1_lmrdac2l_to_dac1l(wm8994_ctx_t *ctx, uint16_t value);

