jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_LMR
* Address       : 0X601
* Bit Group Name: AIF1DACL_TO_DAC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_LMRDACL_TO_DAC1L_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1_DAC1_LMRDACL_TO_DAC1L_POSITION             2
int32_t   wm8994_aif1_dac1_lmrdacl_to_dac1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_LMR
* Address       : 0X601
* Bit Group Name: AIF1ADCL_TO_DAC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_LMRADCL_TO_DAC1L_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1_DAC1_LMRADCL_TO_DAC1L_POSITION             4
int32_t   wm8994_aif1_dac1_lmradcl_to_dac1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_LMR
* Address       : 0X601
* Bit Group Name: AIF1ADCR_TO_DAC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_LMRADCR_TO_DAC1L_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1_DAC1_LMRADCR_TO_DAC1L_POSITION             5
int32_t   wm8994_aif1_dac1_lmradcr_to_dac1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_RMR
* Address       : 0X602
* Bit Group Name: AIF1DAC1R_TO_DAC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_RMRDAC1R_TO_DAC1R_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1_DAC1_RMRDAC1R_TO_DAC1R_POSITION             0
int32_t   wm8994_aif1_dac1_rmrdac1r_to_dac1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_RMR
* Address       : 0X602
* Bit Group Name: AIF1DAC2R_TO_DAC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_RMRDAC2R_TO_DAC1R_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1_DAC1_RMRDAC2R_TO_DAC1R_POSITION             1
int32_t   wm8994_aif1_dac1_rmrdac2r_to_dac1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_RMR
* Address       : 0X602
* Bit Group Name: AIF1DACR_TO_DAC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_RMRDACR_TO_DAC1R_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1_DAC1_RMRDACR_TO_DAC1R_POSITION             2
int32_t   wm8994_aif1_dac1_rmrdacr_to_dac1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_RMR
* Address       : 0X602
* Bit Group Name: AIF1ADCL_TO_DAC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_RMRADCL_TO_DAC1R_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1_DAC1_RMRADCL_TO_DAC1R_POSITION             4
int32_t   wm8994_aif1_dac1_rmradcl_to_dac1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_RMR
* Address       : 0X602
* Bit Group Name: AIF1ADCR_TO_DAC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC1_RMRADCR_TO_DAC1R_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1_DAC1_RMRADCR_TO_DAC1R_POSITION             5
int32_t   wm8994_aif1_dac1_rmradcr_to_dac1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_LMR
* Address       : 0X604
* Bit Group Name: AIF1DAC1L_TO_DAC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_LMRDAC1L_TO_DAC2L_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1_DAC2_LMRDAC1L_TO_DAC2L_POSITION             0
int32_t   wm8994_aif1_dac2_lmrdac1l_to_dac2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_LMR
* Address       : 0X604
* Bit Group Name: AIF1DAC2L_TO_DAC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_LMRDAC2L_TO_DAC2L_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1_DAC2_LMRDAC2L_TO_DAC2L_POSITION             1
int32_t   wm8994_aif1_dac2_lmrdac2l_to_dac2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_LMR
* Address       : 0X604
* Bit Group Name: AIF1DACL_TO_DAC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_LMRDACL_TO_DAC2L_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1_DAC2_LMRDACL_TO_DAC2L_POSITION             2
int32_t   wm8994_aif1_dac2_lmrdacl_to_dac2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_LMR
* Address       : 0X604
* Bit Group Name: AIF1ADCL_TO_DAC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_LMRADCL_TO_DAC2L_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1_DAC2_LMRADCL_TO_DAC2L_POSITION             4
int32_t   wm8994_aif1_dac2_lmradcl_to_dac2l(wm8994_ctx_t *ctx, uint16_t value);

