jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_LMR
* Address       : 0X604
* Bit Group Name: AIF1ADCR_TO_DAC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_LMRADCR_TO_DAC2L_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1_DAC2_LMRADCR_TO_DAC2L_POSITION             5
int32_t   wm8994_aif1_dac2_lmradcr_to_dac2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_RMR
* Address       : 0X605
* Bit Group Name: AIF1DAC1R_TO_DAC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_RMRDAC1R_TO_DAC2R_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1_DAC2_RMRDAC1R_TO_DAC2R_POSITION             0
int32_t   wm8994_aif1_dac2_rmrdac1r_to_dac2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_RMR
* Address       : 0X605
* Bit Group Name: AIF1DAC2R_TO_DAC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_RMRDAC2R_TO_DAC2R_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1_DAC2_RMRDAC2R_TO_DAC2R_POSITION             1
int32_t   wm8994_aif1_dac2_rmrdac2r_to_dac2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_RMR
* Address       : 0X605
* Bit Group Name: AIF1DACR_TO_DAC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_RMRDACR_TO_DAC2R_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1_DAC2_RMRDACR_TO_DAC2R_POSITION             2
int32_t   wm8994_aif1_dac2_rmrdacr_to_dac2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_RMR
* Address       : 0X605
* Bit Group Name: AIF1ADCL_TO_DAC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_RMRADCL_TO_DAC2R_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1_DAC2_RMRADCL_TO_DAC2R_POSITION             4
int32_t   wm8994_aif1_dac2_rmradcl_to_dac2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC2_RMR
* Address       : 0X605
* Bit Group Name: AIF1ADCR_TO_DAC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_RMRADCR_TO_DAC2R_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1_DAC2_RMRADCR_TO_DAC2R_POSITION             5
int32_t   wm8994_aif1_dac2_rmradcr_to_dac2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_LMR
* Address       : 0X606
* Bit Group Name: AIF2DACL_TO_AIF1ADC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1LMR_AIF2DACL_TO_AIF1ADC1L_MASK                 (uint16_t)0x0001
#define   WM8994_ADC1LMR_AIF2DACL_TO_AIF1ADC1L_POSITION             0
int32_t   wm8994_adc1lmr_aif2dacl_to_aif1adc1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_LMR
* Address       : 0X606
* Bit Group Name: ADC1L_TO_AIF1ADC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1LMR_ADC1L_TO_AIF1ADC1L_MASK                 (uint16_t)0x0002
#define   WM8994_ADC1LMR_ADC1L_TO_AIF1ADC1L_POSITION             1
int32_t   wm8994_adc1lmr_adc1l_to_aif1adc1l(wm8994_ctx_t *ctx, uint16_t value);


/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_RMR
* Address       : 0X607
* Bit Group Name: AIF2DACL_TO_AIF1ADC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1RMR_AIF2DACL_TO_AIF1ADC1R_MASK                 (uint16_t)0x0001
#define   WM8994_ADC1RMR_AIF2DACL_TO_AIF1ADC1R_POSITION             0
int32_t   wm8994_adc1rmr_aif2dacl_to_aif1adc1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_RMR
* Address       : 0X607
* Bit Group Name: ADC1R_TO_AIF1ADC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1RMR_ADC1R_TO_AIF1ADC1R_MASK                 (uint16_t)0x0002
#define   WM8994_ADC1RMR_ADC1R_TO_AIF1ADC1R_POSITION             1
int32_t   wm8994_adc1rmr_adc1r_to_aif1adc1r(wm8994_ctx_t *ctx, uint16_t value);
         
/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_LMR
* Address       : 0X608
* Bit Group Name: AIF2DACL_TO_AIF1ADC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2LMR_AIF2DACL_TO_AIF1ADC2L_MASK                 (uint16_t)0x0001
#define   WM8994_ADC2LMR_AIF2DACL_TO_AIF1ADC2L_POSITION             0
int32_t   wm8994_adc2lmr_aif2dacl_to_aif1adc2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_LMR
* Address       : 0X608
* Bit Group Name: ADC2L_TO_AIF1ADC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2LMR_ADC2L_TO_AIF1ADC2L_MASK                 (uint16_t)0x0002
#define   WM8994_ADC2LMR_ADC2L_TO_AIF1ADC2L_POSITION             1
int32_t   wm8994_adc2lmr_adc2l_to_aif1adc2l(wm8994_ctx_t *ctx, uint16_t value);


