jelson/rulos/src/lib/chip/arm/stm32/vendor_libraries/stm32g4/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_DAC2_RIGHT_VOL
* Address       : 0X613
* Bit Group Name: DAC2R_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC2_RIGHT_VOL_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_DAC2_RIGHT_VOL_MUTE_POSITION             9
int32_t   wm8994_dac2_right_vol_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OVERSAMPLING
* Address       : 0X620
* Bit Group Name: DAC_OSR128
* Permission    : RW
*******************************************************************************/
#define   WM8994_OVERSAMPLING_DAC_OSR128_MASK                 (uint16_t)0x0001
#define   WM8994_OVERSAMPLING_DAC_OSR128_POSITION             0
int32_t   wm8994_oversampling_dac_osr128(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OVERSAMPLING
* Address       : 0X620
* Bit Group Name: ADC_OSR128
* Permission    : RW
*******************************************************************************/
#define   WM8994_OVERSAMPLING_ADC_OSR128_MASK                 (uint16_t)0x0002
#define   WM8994_OVERSAMPLING_ADC_OSR128_POSITION             1
int32_t   wm8994_oversampling_adc_osr128(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_FN [4:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_FN_MASK                 (uint16_t)0x001F
#define   WM8994_GPIO1_GP1_FN_POSITION             0
int32_t   wm8994_gpio1_gp1_fn(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_LVL
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_LVL_MASK                 (uint16_t)0x0040
#define   WM8994_GPIO1_GP1_LVL_POSITION             6
int32_t   wm8994_gpio1_gp1_lvl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_DB
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_DB_MASK                 (uint16_t)0x0100
#define   WM8994_GPIO1_GP1_DB_POSITION             8
int32_t   wm8994_gpio1_gp1_db(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_OP_CFG
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_OP_CFG_MASK                 (uint16_t)0x0200
#define   WM8994_GPIO1_GP1_OP_CFG_POSITION             9
int32_t   wm8994_gpio1_gp1_op_cfg(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_POL
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_POL_MASK                 (uint16_t)0x0400
#define   WM8994_GPIO1_GP1_POL_POSITION             10
int32_t   wm8994_gpio1_gp1_pol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_PD
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_PD_MASK                 (uint16_t)0x2000
#define   WM8994_GPIO1_GP1_PD_POSITION             13
int32_t   wm8994_gpio1_gp1_pd(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_PU
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_PU_MASK                 (uint16_t)0x4000
#define   WM8994_GPIO1_GP1_PU_POSITION             14
int32_t   wm8994_gpio1_gp1_pu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_GPIO1
* Address       : 0X700
* Bit Group Name: GP1_DIR
* Permission    : RW
*******************************************************************************/
#define   WM8994_GPIO1_GP1_DIR_MASK                 (uint16_t)0x8000
#define   WM8994_GPIO1_GP1_DIR_POSITION             15
int32_t   wm8994_gpio1_gp1_dir(wm8994_ctx_t *ctx, uint16_t value);

#ifdef __cplusplus
}
#endif

#endif /* WM8994_REG_H */

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
